//Hi, My name is Jake!

/*
정수끼리 연산하면 결과는 정수이다.
10 / 20 은 0.5가 아니라 0이다.
연산자 종류
사칙연산
+ : 더하기
- : 빼기
* : 곱하기
/ : 나누기
논리연산
== : 같다
!= : 다르다
> : 크다(초과)
< : 작다(미만)
>= : 크거나 같다(이상)
<= : 작거나 같다(이하)
&& : 그리고(and)
|| : 또는(or)
소스코드의 4대 구성 요소
변수
변수선언 : int a;
int를 변수타입이라고 한다.
a를 변수명이라고 한다.
a라는 변수를 만들겠습니다. 다만 앞으로 a에는 정수만 담을 수 있습니다. 라는 뜻이다.
변수선언(변수생성)은 2번 이상 할 수 없다.
변수의 값은 바꿀 수 있다.
변수는 값을 넣을 때 빼고는 값(자신이 가지고 있는) 취급을 해야 한다.
값
종류
숫자
문자
...
조건문
if문
if ( 조건문 ) { 실행문 }
추가옵션 : else
if ( 조건문 ) { 실행문1 } else { 실행문2 }
실행문2는 조건이 거짓일 때 실행된다.
양자택일이 된다.
switch문
반복문
연산자 우선순위
우선순위과 높은 것이 먼저 실행된다.
사칙연산자가 논리연산자보다 우선순위가 높다.
*, /는 다른 사칙연산자 보다 우선순위가 높다.
&&, ||는 다른 논리 연산자 보다 우선순위가 낮다.
앞에 있는게 먼저 실행된다.
증감 연산자
i++; => i 의 값을 1 증가 시킨다.
i--; => i 의 값을 1 감소 시킨다.
i = i + 2; => i 의 값을 2 증가 시킨다.
i += 2; => i 의 값을 2 증가 시킨다.(위와 같은 표현)
i = i - 2; => i 의 값을 2 감소 시킨다.
i -= 2; => i 의 값을 2 감소 시킨다.(위와 같은 표현)
*/